app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R')) ORDER BY release_date
---
  def index
#debugger
#rats=params[:ratings].keys.to_s.gsub("[","(").gsub("]",")").gsub("\"","'")
#@movies = Movie.find(:all, :conditions => ["rating IN ?", rats], :order => params[:sort])
    if params[:ratings].nil?
      params[:rats]=get_all_ratings
    else
      params[:rats]=params[:ratings].keys
    end
    @all_ratings=get_all_ratings
    @movies = Movie.find(:all, :conditions => ["rating IN (?)", params[:rats]], :order => params[:sort])